Revit 2027 API
NoiseType Enumeration
 The enumerated type representing the permitted values for the asset property "NoiseType" from the "Noise" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum NoiseType
Public Enumeration NoiseType
public enum class NoiseType
type NoiseType
Members
Member name | Value | Description
Fractal | 1
Regular | 0
Turbulence | 2
See Also
Reference
Autodesk.Revit.DB.Visual Namespace